#include <stdio.h>
#include <stdlib.h>

#define SIZE 12

/*
 * 5. დაწერეთ პროგრამა, რომელიც დაადგენს თუ რამდენი დღე გავიდა წლის
 * დასაწყისიდან (1 იანვრიდან). ჩათვალეთ, რომ მიმდინარე წელი ნაკიანი არ
 * არის.
 * შესატანი მონაცემები: ერთადერთ სტრიქონში ორი მთელი რიცხვი, რომლებიც
 * განსაზღვრავენ მიმდინარე თარიღს. პირველი აღნიშნავს თვის ნომერს, ხოლო
 * მეორე - რიცხვს.
 * გამოსატანი მონაცემები: ერთი მთელი რიცხვი, რომელიც აღნიშნავს თუ მიმდინარე
 * თარიღი მერამდენე დღეა წლის დასაწყისიდან.
 */
int main() {
    int months[SIZE] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};

    int month, day, days_past = 0;

    scanf("%d%d", &month, &day);

    for (int index = 0; index < month - 1; index++) {
        days_past += months[index];
    }

    days_past += day - 1;

    printf("%d", days_past);

    exit(EXIT_SUCCESS);
}