#include <stdio.h>
#include <stdlib.h>

/*
 * ბუბა თამაშობს კუბიკებით. მას აქვს a ცალი ლურჯი, b ცალი წითელი და c
 * ცალი მწვანე კუბიკი.
 *
 * ბუბა აგებს ორი კუბიკისაგან შედგენილ კოშკებს.
 *
 * მაქსიმუმ რამდენ ასეთ კოშკს ააგებს ბუბა განსხვავებული ფერის
 * კუბიკებით და ერთნაირი ფერის კუბიკებით?
 *
 * შესატანი მონაცემები: სამი მთელი რიცხვი a, b და c. მათი დიაპაზონია
 * 1..100.
 *
 * გამოსატანი მონაცემები: ორი მთელი რიცხვი - განსხვავებული ფერის
 * კუბიკებით აგებული კოშკების მაქსიმალური რაოდენობა
 *
 * და ერთნაირი ფერის კუბიკებით აგებული კოშკების მაქსიმალური
 * რაოდენობა.
 *
 * შესატანი მონაცემები
 * 7 11 5
 *
 * გამოსატანი მონაცემები
 * 11 10
 */
int main() {
    int a, b, c, heterogenous, homogenous;

    scanf("%d%d%d", &a, &b, &c);

    homogenous = (a + b + c) / 2;

    if (a > b + c) {
        homogenous = b + c;
    }

    if (b > a + c) {
        homogenous = a + c;
    }

    if (c > a + b) {
        homogenous = a + b;
    }

    heterogenous = a / 2 + b / 2 + c / 2;

    printf("%d %d", homogenous, heterogenous);

    exit(EXIT_SUCCESS);
}