#include <stdio.h>
#include <stdlib.h>

/*
 * მასწავლებელმა ბუბას მისცა 3 მთელი რიცხვი A, B და C. ბუბამ მათზე უნდა
 * შეასრულოს ზუსტად ორი ოპერაცია - ერთი შეკრების და ერთი გამრავლების
 * (ოპერაციების ჩატარების თანმიმდევრობას მნიშვნელობა არ აქვს) და ამ ორი
 * ოპერაციით უნდა მიიღოს რაც შეიძლება მცირე რიცხვი. რიცხვების გადაადგილება არ
 * შეიძლება. დაწერეთ პროგრამა, რომელიც დაეხმარება ბუბას.
 * შესატანი მონაცემები: სამი მთელი რიცხვი - A, B და C (0&lt;=A, B, C&lt;=100).
 * გამოსატანი მონაცემები: უმცირესი რიცხვი, რომლის მიღებაც შეიძლება მოცემული
 * რიცხვებიდან მათზე შეკრების და გამრავლების ოპერაციების ჩატარებით.
 */
int main() {
    int A, B, C;

    scanf("%d%d%d", &A, &B, &C);

    if ((A + B) * C < A * (B + C)) {
        printf("%d", (A + B) * C);
    } else {
        printf("%d", A * (B + C));
    }

    exit(EXIT_SUCCESS);
}