#include <stdio.h>
#include <stdlib.h>

/*
 * მოცემულია N ცალი კალათა და A ცალი ვაშლი
 * (1<=A<=N<=100000). ყოველ კალათაში ერთი მაინც ვაშლი
 * უნდა იდოს. დაადგინეთ, რა მინიმალური და მაქსიმალური
 * რაოდენობის ვაშლი შეიძლება იდოს იმ კალათაში,
 * რომელშიც ყველაზე მეტი ვაშლი დევს.
 *
 * შესატანი მონაცემები: ორი მთელი რიცხვი - A და N.
 *
 * გამოსატანი მონაცემები: ორი მთელი რიცხვი - ვაშლების
 * მინიმალური და მაქსიმალური რაოდენობა იმ კალათაში,
 * რომელშიც ყველაზე მეტი ვაშლი დევს.
 *
 * შესატანი მონაცემები
 * 7 3
 *
 * გამოსატანი მონაცემები
 * 3 5
 */
int main() {
    int a, n, min, max;

    printf("Enter two integers: ");

    scanf("%d%d", &a, &n);

    min = a / n;

    if (a % n != 0) {
        min++;
    }

    max = a - n + 1;

    printf("Result: %d %d", min, max);

    exit(EXIT_SUCCESS);
}
